{
    "irVersion": "6",
    "producerName": "tflite2onnx",
    "graph": {
        "node": [
            {
                "input": [
                    "input",
                    "Variable/read",
                    "Conv2D_bias"
                ],
                "output": [
                    "output"
                ],
                "name": "output",
                "opType": "Conv",
                "attribute": [
                    {
                        "name": "dilations",
                        "ints": [
                            "1",
                            "1"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "group",
                        "i": "1",
                        "type": "INT"
                    },
                    {
                        "name": "kernel_shape",
                        "ints": [
                            "3",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "pads",
                        "ints": [
                            "1",
                            "1",
                            "1",
                            "1"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "strides",
                        "ints": [
                            "1",
                            "1"
                        ],
                        "type": "INTS"
                    }
                ]
            }
        ],
        "name": "pre-alpha",
        "initializer": [
            {
                "dims": [
                    "16"
                ],
                "dataType": 1,
                "floatData": [
                    0.45175773,
                    -0.014192663,
                    0.2946249,
                    -0.9742919,
                    -1.2975587,
                    0.7223454,
                    0.78357005,
                    1.7674627,
                    1.7242873,
                    1.1230682,
                    -0.29025316,
                    0.2627835,
                    1.0175092,
                    0.5643373,
                    -0.8244842,
                    1.2169424
                ],
                "name": "Conv2D_bias"
            },
            {
                "dims": [
                    "16",
                    "8",
                    "3",
                    "3"
                ],
                "dataType": 1,
                "floatData": [
                    -0.0130125275,
                    -0.02293778,
                    -0.02050116,
                    -0.12179337,
                    -0.1456314,
                    0.09957694,
                    0.017575486,
                    0.081102036,
                    0.17885453,
                    -0.059973866,
                    -0.08414837,
                    0.13347109,
                    -0.040851645,
                    0.16459718,
                    -0.17939876,
                    -0.089359365,
                    0.039529227,
                    0.14009179,
                    -0.04677037,
                    0.042493254,
                    0.107083395,
                    -0.017265908,
                    0.1603434,
                    0.024304647,
                    0.044352796,
                    -0.04915511,
                    0.11290433,
                    -0.16437489,
                    0.019816453,
                    0.029850785,
                    0.06446802,
                    -0.07746291,
                    -0.13288745,
                    -0.09447722,
                    -0.0328612,
                    0.044448774,
                    -0.037225325,
                    0.009099807,
                    0.16559215,
                    0.10914721,
                    0.028801477,
                    -0.11851194,
                    -0.087306455,
                    -0.0033505626,
                    0.11950797,
                    -0.08452233,
                    0.07213252,
                    -0.08419645,
                    0.057689983,
                    -0.014765984,
                    0.06559077,
                    0.06762989,
                    -0.015301533,
                    0.0009784048,
                    -0.09746808,
                    0.08094775,
                    -0.03847843,
                    0.18761863,
                    -0.11722513,
                    -0.04833382,
                    -0.035847895,
                    -0.11779188,
                    -0.15956947,
                    -0.009003579,
                    -0.04020629,
                    0.07582026,
                    -0.05788974,
                    0.083491735,
                    -0.019588443,
                    0.06033094,
                    -0.041695822,
                    -0.07009228,
                    -0.004708785,
                    0.029634032,
                    0.07287811,
                    -0.18097465,
                    0.13174343,
                    0.11679467,
                    0.028995166,
                    0.1735637,
                    -0.10552841,
                    0.0964699,
                    0.04798874,
                    -0.0015039447,
                    0.09335285,
                    0.12609152,
                    -0.08640258,
                    -0.07620423,
                    0.00753093,
                    0.102582596,
                    -0.027646327,
                    -0.17119274,
                    -0.056228656,
                    -0.002478088,
                    0.13543731,
                    0.0009849289,
                    -0.0216231,
                    -0.03093266,
                    0.11737853,
                    0.041088685,
                    -0.111021094,
                    0.027664138,
                    -0.112878874,
                    0.082288705,
                    0.08620861,
                    0.039358106,
                    0.09001093,
                    -0.043451156,
                    -0.09472481,
                    -0.020647695,
                    -0.029862572,
                    0.024239719,
                    0.1019905,
                    0.084379315,
                    0.08003887,
                    0.036883093,
                    -0.015313118,
                    -0.12196239,
                    0.07361319,
                    0.07747456,
                    -0.117468454,
                    -0.15526325,
                    0.013965562,
                    -0.09466745,
                    -0.039169747,
                    0.035320032,
                    -0.08495416,
                    -0.054293107,
                    0.01652961,
                    0.00650876,
                    0.14921746,
                    0.07949982,
                    -0.050155737,
                    -0.006542989,
                    0.058124285,
                    -0.06276519,
                    0.035788383,
                    0.014486076,
                    -0.16895407,
                    -0.06849584,
                    0.13785386,
                    0.011720321,
                    -0.09714397,
                    -0.057828177,
                    0.04692312,
                    -0.06032989,
                    -0.029170578,
                    -0.07660654,
                    0.05896621,
                    0.10633669,
                    -0.039710503,
                    -0.015500742,
                    0.011782462,
                    0.07685273,
                    0.020318268,
                    -0.10802676,
                    0.04834524,
                    -0.07727146,
                    -0.12889294,
                    0.034649003,
                    -0.11285998,
                    0.16900459,
                    0.05678115,
                    0.028058534,
                    -0.14232074,
                    0.013338837,
                    0.1310436,
                    0.08900359,
                    0.04534692,
                    -0.00611071,
                    0.0029210658,
                    0.1098763,
                    -0.118224375,
                    0.18105915,
                    0.005772661,
                    -0.026859034,
                    0.021908136,
                    4.9758226e-05,
                    0.05262838,
                    -0.06971484,
                    -0.04881114,
                    -0.035400465,
                    -0.14823608,
                    -0.009178115,
                    -0.16376983,
                    0.020387057,
                    -0.06945085,
                    -0.04629152,
                    0.12383369,
                    -0.049617022,
                    -0.036467783,
                    0.16313803,
                    -0.10988146,
                    0.06487898,
                    0.15263467,
                    -0.040345356,
                    0.08270306,
                    0.09591868,
                    0.061135527,
                    0.041478455,
                    0.0761176,
                    0.041546978,
                    0.10690351,
                    0.047823306,
                    -0.02440886,
                    0.010894847,
                    -0.0032150988,
                    0.18943517,
                    -0.011878568,
                    -0.049651276,
                    -0.0825367,
                    0.043236118,
                    -0.07845694,
                    0.033469446,
                    0.03474555,
                    0.085636884,
                    -0.07416739,
                    -0.028717274,
                    -0.056245375,
                    -0.07340987,
                    -0.074824154,
                    0.094233625,
                    0.03105551,
                    -0.034349266,
                    -0.12523921,
                    0.03598457,
                    0.13735738,
                    -0.09344025,
                    -0.07635751,
                    0.11857901,
                    0.1071185,
                    0.024454838,
                    -0.0150908455,
                    0.04962761,
                    -0.08538018,
                    0.12503533,
                    -0.03207391,
                    -0.08485317,
                    0.021638175,
                    0.14669341,
                    -0.04417061,
                    -0.08524958,
                    0.036930576,
                    0.04283273,
                    0.038077854,
                    -0.07627379,
                    -0.09272151,
                    -0.11561753,
                    -0.08903653,
                    -0.080126874,
                    0.13607077,
                    -0.024127072,
                    -0.016668824,
                    0.12830438,
                    0.03990197,
                    0.028192941,
                    -0.13029061,
                    -0.06819852,
                    0.04719079,
                    -0.015857276,
                    -0.08440594,
                    -0.009336017,
                    -0.047802735,
                    0.11762613,
                    0.016357422,
                    -0.011291015,
                    0.037196077,
                    -0.102250434,
                    0.085005626,
                    0.15715165,
                    -0.053755976,
                    -0.0339399,
                    0.03392167,
                    -0.12789407,
                    0.11912055,
                    -0.03087858,
                    0.011630426,
                    -0.02392419,
                    0.11543343,
                    0.024364216,
                    0.042811558,
                    0.090846755,
                    0.043402586,
                    -0.035722557,
                    0.021281473,
                    0.0027259756,
                    -0.060206264,
                    0.12577763,
                    0.08736176,
                    -0.032783143,
                    0.029632334,
                    -0.10429975,
                    0.10129049,
                    0.015642112,
                    -0.122429945,
                    0.16828431,
                    -0.11004072,
                    -0.08417054,
                    -0.124723434,
                    0.010179798,
                    -0.074713685,
                    -0.028637556,
                    -0.14875466,
                    -0.18115214,
                    0.12615244,
                    0.037099544,
                    0.026882453,
                    0.09884303,
                    0.09526112,
                    0.016333751,
                    0.047088332,
                    0.04257163,
                    -0.1380678,
                    0.057349052,
                    0.089143656,
                    -0.094763964,
                    0.07038355,
                    -0.07057337,
                    0.1201209,
                    0.13143921,
                    -0.09505406,
                    -0.002175081,
                    0.14814898,
                    0.14281753,
                    0.05209406,
                    -0.13948546,
                    -0.018152859,
                    -0.0023711992,
                    -0.06549682,
                    -0.037698932,
                    -0.041468278,
                    0.08770081,
                    0.075971216,
                    -0.029399654,
                    -0.011072322,
                    0.06999085,
                    0.07538042,
                    0.11031278,
                    -0.06122269,
                    0.18935584,
                    0.030715361,
                    -0.008239931,
                    -0.10968941,
                    0.036073755,
                    0.090285,
                    -0.06770063,
                    -0.019744853,
                    -0.037376463,
                    -0.095635526,
                    0.1883599,
                    0.060231965,
                    0.06993939,
                    -0.020442313,
                    0.055239655,
                    -0.078528084,
                    0.1906725,
                    0.104052365,
                    0.023433145,
                    0.09270261,
                    0.14700148,
                    0.19102499,
                    -0.009703201,
                    0.0916276,
                    -0.042054486,
                    0.18279357,
                    -0.014583625,
                    -0.009102262,
                    0.06488648,
                    -0.072732985,
                    0.15923975,
                    0.0859929,
                    0.074075885,
                    0.049161065,
                    -0.09352659,
                    0.11329835,
                    0.06485411,
                    0.065514944,
                    0.17234927,
                    0.0027763764,
                    -0.0156060895,
                    0.015208574,
                    0.022157254,
                    0.12928006,
                    -0.16072689,
                    0.13121979,
                    -0.05052909,
                    -0.17024909,
                    0.0420026,
                    0.061621305,
                    0.017367298,
                    0.044077717,
                    -0.06500878,
                    0.07706223,
                    -0.034171294,
                    -0.17594826,
                    0.018262593,
                    -0.0691284,
                    0.0224288,
                    0.09383995,
                    0.1675143,
                    -0.19190113,
                    0.025178015,
                    0.16282277,
                    0.06965447,
                    0.04142859,
                    0.038353216,
                    0.040205926,
                    -0.049952626,
                    0.002246679,
                    0.13876878,
                    -0.12713246,
                    0.07898315,
                    -0.052862305,
                    -0.017969629,
                    -0.0020991093,
                    0.04899094,
                    -0.06090563,
                    -0.14374696,
                    0.12134947,
                    0.07362278,
                    0.04049982,
                    -0.14986412,
                    -0.08150663,
                    -0.058896244,
                    -0.109254636,
                    -0.10408684,
                    -0.02386891,
                    -0.05096164,
                    0.09266779,
                    0.1552122,
                    0.056937497,
                    -0.008870434,
                    0.038837757,
                    0.036918305,
                    0.028318048,
                    0.082694165,
                    0.035186283,
                    -0.035543866,
                    0.0047022896,
                    -0.08701827,
                    -0.07095438,
                    -0.041735493,
                    0.10097388,
                    -0.16272414,
                    0.061589003,
                    -0.078745775,
                    0.13223132,
                    -0.124347225,
                    -0.021235785,
                    -0.004762891,
                    -0.12885503,
                    -0.11897166,
                    0.105795525,
                    0.16916536,
                    0.068856575,
                    0.051858265,
                    0.12096536,
                    0.0816485,
                    -0.09926977,
                    -0.08598699,
                    -0.04434638,
                    0.052860267,
                    -0.118757606,
                    -0.029967997,
                    0.04351848,
                    -0.009632064,
                    -0.08508087,
                    -0.057241052,
                    0.0040221736,
                    0.19911762,
                    -0.039046153,
                    0.0375172,
                    -0.038663276,
                    0.07775724,
                    0.056984838,
                    -0.0057724486,
                    -0.08272959,
                    0.074176766,
                    0.156802,
                    0.16817915,
                    0.041152116,
                    0.13912986,
                    0.1489537,
                    -0.04070218,
                    0.04337473,
                    0.029682174,
                    -0.069075756,
                    0.10632376,
                    0.018294415,
                    -0.09056255,
                    -0.040128786,
                    -0.06301178,
                    -0.12528159,
                    0.10139044,
                    -0.07898154,
                    0.19530272,
                    -0.034070533,
                    -0.110941224,
                    0.0017459883,
                    0.15516579,
                    -0.07922935,
                    0.11166338,
                    -0.1395311,
                    -0.02736604,
                    0.1307457,
                    -0.052414548,
                    0.09375298,
                    0.060016196,
                    0.100888036,
                    0.0017918004,
                    0.0007455522,
                    0.03611647,
                    0.036862083,
                    0.03299686,
                    0.0634649,
                    0.033307664,
                    0.006512949,
                    0.17451502,
                    0.029923646,
                    0.09737491,
                    -0.07452405,
                    -0.04984816,
                    0.15677506,
                    -0.052688625,
                    -0.13776581,
                    0.06883795,
                    0.0637931,
                    0.0380566,
                    0.03437848,
                    0.16497056,
                    0.07259715,
                    -0.13343912,
                    0.040085476,
                    0.06970659,
                    -0.061918158,
                    -0.078473374,
                    0.043649517,
                    0.037107777,
                    0.088294685,
                    -0.022525387,
                    0.14524214,
                    0.028097397,
                    0.13268346,
                    0.109467976,
                    -0.13086186,
                    -0.07931239,
                    0.013411327,
                    0.16039738,
                    0.11589266,
                    -0.08646228,
                    -0.008238486,
                    -0.07268921,
                    -0.110653296,
                    0.013451873,
                    -0.00077418634,
                    -0.02396354,
                    -0.17237872,
                    0.07057714,
                    -0.1222894,
                    0.08960948,
                    0.16953646,
                    -0.18651007,
                    -0.038627964,
                    0.07096013,
                    0.027637122,
                    -0.096276335,
                    -0.16695489,
                    0.12204335,
                    0.13459623,
                    -0.11125745,
                    -0.06995778,
                    -0.01177285,
                    0.052001536,
                    0.02490148,
                    -0.085880466,
                    0.08180124,
                    0.016099416,
                    -0.029409215,
                    0.013624574,
                    0.042628612,
                    -0.039425578,
                    0.04366326,
                    0.069817215,
                    0.056460362,
                    0.028876936,
                    -0.0020222955,
                    0.025962263,
                    -0.1113739,
                    -0.08108659,
                    -0.037547816,
                    0.022443458,
                    -0.059863426,
                    -0.055795144,
                    0.05090878,
                    0.018254226,
                    0.028335446,
                    -0.13586228,
                    0.031033656,
                    -0.14725415,
                    0.02521569,
                    -0.17920169,
                    -0.081245735,
                    0.1619388,
                    -0.03528611,
                    -0.047412112,
                    0.11187806,
                    -0.030318186,
                    -0.06266245,
                    0.11798624,
                    0.038739122,
                    -0.022090487,
                    0.108893804,
                    0.041355874,
                    -0.14203702,
                    -0.092698276,
                    -0.010748859,
                    -0.048678037,
                    -0.06326913,
                    -0.023446579,
                    -0.11386589,
                    0.036100637,
                    -0.09087487,
                    0.14498417,
                    -0.043887224,
                    -0.12280778,
                    -0.028967932,
                    0.13720344,
                    -0.09754821,
                    6.530925e-05,
                    -0.057585288,
                    0.027831132,
                    -0.024946682,
                    -0.0013814037,
                    -0.0027377594,
                    0.008040338,
                    -0.14828275,
                    -0.16461496,
                    0.1368289,
                    -0.03271944,
                    0.057929546,
                    0.049118873,
                    0.17597425,
                    0.022296226,
                    0.10295577,
                    0.061032575,
                    0.13904272,
                    0.09673898,
                    0.019570706,
                    0.042663645,
                    -0.066751406,
                    -0.1081266,
                    0.13461918,
                    -0.0013499794,
                    -0.0713909,
                    0.1256928,
                    0.11332796,
                    -0.1148019,
                    0.014866947,
                    -0.17130347,
                    0.11479665,
                    0.045617994,
                    0.014352805,
                    0.07429155,
                    0.064276375,
                    0.09104501,
                    0.02848768,
                    0.13231713,
                    -0.122951046,
                    0.00016973626,
                    -0.0015891582,
                    0.010838644,
                    0.01873049,
                    0.04884822,
                    -0.08799784,
                    -0.091525204,
                    0.07810448,
                    0.044808015,
                    0.046659928,
                    -0.016751898,
                    0.022110274,
                    0.1381327,
                    -0.01768274,
                    0.044724483,
                    -0.10664783,
                    -0.10817808,
                    0.1113006,
                    -0.009349241,
                    0.009579017,
                    0.08562615,
                    0.12167598,
                    -0.15534377,
                    -0.13461256,
                    0.048475903,
                    0.06450937,
                    0.07975032,
                    -0.045036566,
                    -0.046269342,
                    0.0219017,
                    0.05336842,
                    -0.076811895,
                    0.16307256,
                    -0.035288364,
                    -0.117541455,
                    0.11064043,
                    0.1273887,
                    0.108097665,
                    0.013332739,
                    0.0015499496,
                    -0.066670105,
                    -0.018865172,
                    -0.07378793,
                    0.1747328,
                    0.04925504,
                    -0.031852458,
                    0.08747902,
                    0.050719034,
                    0.019687083,
                    0.019214235,
                    -0.13021488,
                    -0.02492611,
                    0.05748945,
                    -0.0318978,
                    -0.19263011,
                    0.10939449,
                    0.030603683,
                    0.036462676,
                    -0.049141206,
                    0.072692424,
                    0.12022682,
                    -0.13794108,
                    0.040042114,
                    -0.063349366,
                    0.0040904586,
                    -0.053850014,
                    -0.12287124,
                    0.030758345,
                    0.027103439,
                    -0.05606199,
                    0.078274004,
                    -0.03370041,
                    0.020517778,
                    0.07059395,
                    0.09881069,
                    0.049420446,
                    -0.1348475,
                    -0.088429146,
                    -0.07188541,
                    -0.031742502,
                    0.05690795,
                    -0.09079396,
                    0.06789924,
                    0.056987375,
                    -0.035490934,
                    -0.031118268,
                    -0.059687026,
                    0.081390284,
                    0.006405517,
                    -0.04346968,
                    -0.08651457,
                    0.030787526,
                    0.10112236,
                    -0.022114273,
                    0.06468061,
                    -0.084274516,
                    0.04181826,
                    -0.060953062,
                    -0.0745769,
                    -0.01926942,
                    -0.09439983,
                    -0.09517266,
                    -0.0013771243,
                    -0.014297292,
                    0.17600136,
                    -0.04991849,
                    -0.041679453,
                    0.0014557479,
                    0.035648156,
                    -0.16116564,
                    -0.025506005,
                    0.04604802,
                    -0.16817608,
                    -0.10690141,
                    0.06569894,
                    -0.08290178,
                    -0.034888085,
                    -0.07842746,
                    -0.045843404,
                    -0.028802613,
                    -0.08375385,
                    -0.18331163,
                    0.07475511,
                    -0.11936944,
                    -0.12562071,
                    0.09131752,
                    -0.0020741231,
                    -0.017062372,
                    -0.019872252,
                    -0.12022567,
                    0.016646069,
                    -0.035900325,
                    0.07072958,
                    0.032603003,
                    -0.041014057,
                    -0.08705773,
                    -0.015978944,
                    0.18615818,
                    0.07023427,
                    0.019220939,
                    -0.1792881,
                    0.14248218,
                    -0.1389696,
                    0.06488308,
                    0.16838606,
                    -0.10070925,
                    -0.15552941,
                    0.1084847,
                    -0.12630413,
                    -0.09762516,
                    0.007381522,
                    0.19543533,
                    -0.010139483,
                    0.12811504,
                    0.056497037,
                    -0.00015362258,
                    0.12397722,
                    -0.058985054,
                    -0.08045231,
                    -0.020139193,
                    0.009546777,
                    0.18032114,
                    0.119521774,
                    0.04222143,
                    -0.05990806,
                    0.11595028,
                    -0.022407962,
                    0.1330092,
                    -0.032762997,
                    0.12952112,
                    -0.13012213,
                    -0.028524214,
                    0.0021723686,
                    -0.10631647,
                    -0.0058822227,
                    -0.02447447,
                    -0.033891287,
                    -0.037026346,
                    -0.050072588,
                    -0.15852465,
                    0.06166926,
                    0.02192984,
                    -0.023687635,
                    -0.020086972,
                    -0.07108586,
                    0.018354407,
                    -0.10214873,
                    0.0056536207,
                    -0.036442652,
                    0.100443386,
                    0.036174405,
                    -0.1167806,
                    -0.049487073,
                    0.011053226,
                    0.15782633,
                    -0.07056028,
                    -0.020115238,
                    0.18407093,
                    -0.05902365,
                    -0.14462814,
                    -0.084373206,
                    -0.031250127,
                    -0.037586987,
                    -0.11278763,
                    -0.13064478,
                    -0.088217795,
                    0.027659869,
                    -0.05211532,
                    -0.0077917697,
                    -0.0072745965,
                    0.09647819,
                    0.06809472,
                    0.13232447,
                    0.092924245,
                    0.10729915,
                    -0.03320066,
                    0.019477338,
                    -0.036513682,
                    -0.0684082,
                    0.15911622,
                    0.087582365,
                    -0.035396554,
                    -0.054542787,
                    -0.056804337,
                    0.114694476,
                    0.06184373,
                    -0.088120356,
                    -0.08831121,
                    0.054094393,
                    0.0131776305,
                    0.06473298,
                    0.10692289,
                    -0.02813333,
                    -0.07302176,
                    -0.031684034,
                    -0.021907002,
                    0.008418175,
                    -0.074099,
                    0.13781324,
                    0.115349844,
                    -0.013085074,
                    -0.18205689,
                    -0.12344289,
                    -0.061932024,
                    -0.036985204,
                    0.009695808,
                    -0.06922986,
                    0.19107728,
                    0.06426983,
                    -0.10040399,
                    -0.039507464,
                    0.1220293,
                    -0.101861216,
                    0.00042914558,
                    0.07780745,
                    -0.14397429,
                    -0.09172853,
                    0.0044471063,
                    -0.1430666,
                    0.0012741912,
                    0.018715039,
                    -0.14859895,
                    0.10202,
                    0.03761519,
                    -0.0017111757,
                    -0.14139864,
                    0.054054882,
                    0.040857125,
                    -0.18970375,
                    0.07838894,
                    -0.06466799,
                    0.03127737,
                    -0.050576616,
                    0.061160713,
                    -0.015238242,
                    0.19365047,
                    -0.040763896,
                    0.14012043,
                    -0.07303588,
                    0.11537262,
                    0.111407794,
                    0.007862028,
                    0.013278956,
                    -0.16567135,
                    0.19464485,
                    -0.15752915,
                    -0.087498985,
                    0.08752658,
                    0.084751576,
                    -0.123538844,
                    0.12615733,
                    0.09563953,
                    0.13596773,
                    0.030924937,
                    0.024376502,
                    0.14345121,
                    -0.05093659,
                    -0.11545402,
                    0.06134826,
                    0.19594876,
                    -0.10366746,
                    -0.09332015,
                    -0.05202824,
                    -0.09934241,
                    0.082273275,
                    -0.046469793,
                    0.027526408,
                    0.011570266,
                    0.1145,
                    -0.04625943,
                    -0.098295175,
                    0.009585092,
                    -0.04823814,
                    0.079617515,
                    0.023976099,
                    -0.06384,
                    -0.03024349,
                    0.046605613,
                    0.004111108,
                    -0.020713102,
                    0.00034775885,
                    0.1214957,
                    -0.05025462,
                    -0.07861336,
                    -0.0124583505,
                    -0.17174184,
                    -0.005028305,
                    -0.17930475,
                    0.18333463,
                    0.013697796,
                    0.079504155,
                    0.022161918,
                    -0.030673375,
                    -0.05075509,
                    0.08140269,
                    -0.016895628,
                    0.17520668,
                    -0.09135809,
                    -0.08409619,
                    0.062594615,
                    -0.085522026,
                    0.103835344,
                    0.17067486,
                    0.09367315,
                    -0.15602975,
                    0.09154921,
                    0.06711983,
                    -0.057507094,
                    0.062365126,
                    -0.07003948,
                    -0.0539661,
                    -0.06540428,
                    0.011482159,
                    -0.054410785,
                    0.01649709,
                    0.059760537,
                    0.09003771,
                    0.059172403,
                    0.034767028,
                    0.016394505,
                    0.13635974,
                    -0.11124003,
                    -0.14820634,
                    -0.08960891,
                    0.024915852,
                    0.012091224,
                    0.13376652,
                    0.06788655,
                    -0.11333652,
                    0.026032245,
                    0.051153142,
                    0.030380843,
                    0.06868261,
                    0.12263358,
                    0.06693997,
                    0.04799325,
                    0.06546717,
                    0.043035638,
                    0.06554767,
                    -0.058268767,
                    -0.021598883,
                    -0.18238088,
                    0.050493807,
                    -0.055716693,
                    -0.04357616,
                    -0.02255418,
                    0.0835457,
                    0.025071818,
                    0.06929015,
                    -0.16202636,
                    -0.050494332,
                    0.083586715,
                    -0.080803335,
                    -0.13620551,
                    -0.07432559,
                    -0.04737445,
                    0.06364333,
                    0.05501922,
                    -0.045457136,
                    0.067156,
                    0.114023544,
                    -0.07665921,
                    -0.1219662,
                    0.02786325,
                    0.036959026,
                    0.16958909,
                    0.059606165,
                    0.044867333,
                    -0.11000808,
                    0.031754676,
                    -0.15755078,
                    0.013221039,
                    0.0987926,
                    -0.06678227,
                    0.07734111,
                    -0.097857825,
                    0.08410404,
                    -0.07732686,
                    -0.050289143,
                    -0.17881216,
                    -0.061387192,
                    -0.05255661,
                    -0.0044893543,
                    0.1120888,
                    -0.110913835,
                    -0.067240916,
                    0.04416417,
                    0.058467325,
                    -0.026790962,
                    0.100948595,
                    -0.13327192,
                    0.02317225,
                    -0.07154636,
                    0.105266765,
                    0.09610879,
                    -0.0055469493,
                    -0.031144997,
                    0.07847341,
                    -0.069701634,
                    -0.097706474,
                    -0.16759728,
                    -0.051515546,
                    0.10503709,
                    -0.06581617,
                    0.06850721,
                    0.04682139,
                    0.06150831,
                    -0.035268705,
                    -0.00507706,
                    -0.04457676,
                    0.1671364,
                    -0.06795897,
                    0.08729633,
                    0.12429833,
                    0.18128268,
                    0.006304243,
                    -0.04526374,
                    -0.022607632,
                    0.017288057,
                    0.12217921,
                    -0.17506264,
                    0.064338915,
                    -0.08289045,
                    0.0018818055,
                    -0.0036637075,
                    -0.020755623,
                    -0.1735069,
                    -0.009620648,
                    0.12810373,
                    -0.051620584,
                    -0.1901012,
                    -0.09982707,
                    -0.060806364,
                    -0.012847932,
                    0.050298024,
                    -0.10905802,
                    -0.0076324046,
                    0.06331649,
                    -0.078658424,
                    -0.031436425,
                    -0.011196864,
                    0.053338435,
                    -0.045803625,
                    -0.1854383
                ],
                "name": "Variable/read"
            }
        ],
        "input": [
            {
                "name": "input",
                "type": {
                    "tensorType": {
                        "elemType": 1,
                        "shape": {
                            "dim": [
                                {
                                    "dimValue": "1"
                                },
                                {
                                    "dimValue": "8"
                                },
                                {
                                    "dimValue": "32"
                                },
                                {
                                    "dimValue": "32"
                                }
                            ]
                        }
                    }
                }
            }
        ],
        "output": [
            {
                "name": "output",
                "type": {
                    "tensorType": {
                        "elemType": 1,
                        "shape": {
                            "dim": [
                                {
                                    "dimValue": "1"
                                },
                                {
                                    "dimValue": "16"
                                },
                                {
                                    "dimValue": "32"
                                },
                                {
                                    "dimValue": "32"
                                }
                            ]
                        }
                    }
                }
            }
        ],
        "valueInfo": [
            {
                "name": "input",
                "type": {
                    "tensorType": {
                        "elemType": 1,
                        "shape": {
                            "dim": [
                                {
                                    "dimValue": "1"
                                },
                                {
                                    "dimValue": "8"
                                },
                                {
                                    "dimValue": "32"
                                },
                                {
                                    "dimValue": "32"
                                }
                            ]
                        }
                    }
                }
            },
            {
                "name": "output",
                "type": {
                    "tensorType": {
                        "elemType": 1,
                        "shape": {
                            "dim": [
                                {
                                    "dimValue": "1"
                                },
                                {
                                    "dimValue": "16"
                                },
                                {
                                    "dimValue": "32"
                                },
                                {
                                    "dimValue": "32"
                                }
                            ]
                        }
                    }
                }
            }
        ]
    },
    "opsetImport": [
        {
            "domain": "",
            "version": "11"
        }
    ]
}